In [1]:
#I YOUR EDNA, KOBO, confirm - by submitting this document - that the solutions in this notebook are a result of my own work 
#and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

In [2]:
%load_ext sql

In [3]:
%%sql 

sqlite:///TMDB.db

In [4]:
#QUESTION 1

#What query would you write to change the name of the language with the 'zh' iso code in the "Languages" table to Chinese?

#`UPDATE Languages (language_name = 'Chinese') WHERE iso_639_1 = 'zh'`
#`MODIFY Languages SET language_name = 'Chinese' WHERE iso_639_1 = 'zh'`
#`ALTER Languages SET language_name = 'Chinese' WHERE iso_639_1 = 'zh'`
#`UPDATE Languages SET language_name = 'Chinese' WHERE iso_639_1 = 'zh'`

In [5]:
%%sql
UPDATE Languages
SET language_name = 'Chinese'
WHERE iso_639_1 = 'zh';

 * sqlite:///TMDB.db
0 rows affected.

[]

In [6]:
#QUESTION 2

#What query would you write to insert a new genre called Sport with an id of 10?

#`INSERT (genre_id, genre_name) INTO Genres SET VALUE (10, 'Sport')`
#`INSERT Genres (genre_id, genre_name) Values (10, 'Sport')`
#`INSERT INTO Genres (genre_id, genre_name) Values (10, 'Sport')`
#`INSERT INTO Genres (genre_id = 10, genre_name = 'Sport')`

In [68]:
%%sql
INSERT INTO Genres (genre_id, genre_name) 
VALUES (10, 'Sport')

 * sqlite:///TMDB.db
1 rows affected.

[]

In [8]:
#QUESTION 3

#You have just watched The Flintstones movie and did not find it very funny. 
#What code would delete the entry that links The Flintstones to the Comedy genre?

#`DELETE FROM genremap (genre_id = 35, movie_id = 888)`
#`DELETE ENTRY FROM genremap WHERE genre_id = 35 and movie_id = 888`
#`REMOVE ENTRY FROM genremap WHERE genre_id = 35 and movie_id = 888`
#`DELETE FROM genremap WHERE genre_id = 35 and movie_id = 888`

In [33]:
%%sql
DELETE FROM genremap 
WHERE genre_id = 35 
AND movie_id = 888;

 * sqlite:///TMDB.db
1 rows affected.

[]

In [11]:
#QUESTION 4

#What query would you write to add a column to the language table that could be used for 
#the English names of the different languages?

#`UPDATE TABLE languages APPEND language_english_name varchar(50)`
#`UPDATE TABLE languages ADD language_english_name`
#`ALTER TABLE languages ADD language_english_name varchar(50)`
#`ALTER TABLE languages ADD language_english_name`

In [18]:
%%sql
ALTER TABLE Languages
ADD COLUMN language_english_name VARCHAR(50);

 * sqlite:///TMDB.db
Done.

[]

In [ ]:
#QUESTION 5

#If the foreign keys in the GenreMap table are set to ON DELETE CASCADE, which of the following is true?

#Deleting an entry in the 'GenreMap' table will lead to all entries with a matching 'genre_id' in the 'Genre' table to also be deleted.
#Deleting an entry in the 'Genre' table will lead to all entries with a matching 'genre_id' in the 'GenreMap' table to also be deleted.
#Deleting an entry in the 'GenreMap' table will lead to entries with a matching 'movie_id' in the 'Movies' table to also be deleted.
#Deleting an entry in 'GenreMap' will lead to no other changes in the data.

In [46]:
%%sql
CREATE TABLE IF NOT EXISTS Favourites (
    movie_id INTEGER,
    PRIMARY KEY (movie_id),
    FOREIGN KEY (movie_id) REFERENCES Movies (movie_id) ON DELETE CASCADE
);

 * sqlite:///TMDB.db
Done.

[]

In [13]:
#QUESTION 6

#What query would you write to create a new table called Favourites that only has one column for the movie_id?

#`NEW TABLE Favourites(movie_id int)`
#`CREATE TABLE Favourites with COLUMN(movie_id int)`
#`NEW TABLE Favourites with COLUMN(movie_id int)`
#`CREATE TABLE Favourites ( movie_id int)`

In [42]:
%%sql
CREATE TABLE Favourites (
    movie_id INTEGER NOT NULL,
    PRIMARY KEY (movie_id),
    FOREIGN KEY (movie_id) REFERENCES Movies (movie_id)
);

 * sqlite:///TMDB.db
Done.

[]

In [ ]:
#QUESTION 7

#When using SQLite, if you want to make sure that you do not put duplicates in your new Favourites table, how would you have created your 'Favourites' table?

#`NEW TABLE FAVOURITES with COLUMN(movie_id int unique)`
#`NEW TABLE Favourites(movie_id int unique)`
#`CREATE TABLE Favourites (movie_id int unique)`
#`CREATE TABLE Favourites (movie_id int IS unique)`

In [60]:
%%sql
CREATE TABLE Favourites (
    movie_id INTEGER UNIQUE,
    PRIMARY KEY (movie_id),
    FOREIGN KEY (movie_id) REFERENCES Movies (movie_id) ON DELETE CASCADE
);

 * sqlite:///TMDB.db
Done.

[]

In [ ]:
#QUESTION 8

#When using SQLite, and you want your new 'Favourites' table to also hold the names of your favourite movies.
#What query would you write to introduce this new column?

#`ALTER TABLE Favourites MODIFY COLUMN(movie_name VARCHAR)`
#`UPDATE TABLE Favourites ADD COLUMN movie_name VARCHAR`
#`ALTER TABLE Favourites ADD COLUMN movie_name VARCHAR`
#`UPDATE TABLE Favourites MODIFY COLUMN(movie_name VARCHAR)`

In [51]:
%%sql
ALTER TABLE Favourites 
ADD COLUMN movie_name VARCHAR;

 * sqlite:///TMDB.db
Done.

[]

In [ ]:
#QUESTION 9

#What would the following query do?

#INSERT INTO Favourites
#SELECT title FROM Movies
#WHERE popularity > 100;

#Inserts the movie_id of all movies with a popularity of more than 100 into the Favourites table.
#Inserts the names of the 100 most popular movies into the Favourites table.
#Inserts the names of all movies with a popularity of more than 100 into the Favourites table.
#Displays the names of all movies with a popularity of more than 100 but does not change anything in the tables.

In [56]:
%%sql
INSERT INTO Favourites (movie_id, movie_name)
SELECT movie_id, title FROM Movies
WHERE popularity > 100;

 * sqlite:///TMDB.db
2 rows affected.

[]

In [1]:
#QUESTION 10

#What query would you write to delete the table Favourites that we created in the previous question?

#DROP TABLE Favourites
#PURGE TABLE FAvourites
#REMOVE TABLE Favourites
#DELETE TABLE Favourites

In [59]:
%%sql
DROP TABLE Favourites;

 * sqlite:///TMDB.db
Done.

[]